// pages/catalog/catalog.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    catalog:[
        "第一卷江左梅郎第一章两姓之子",
        "第一卷江左梅郎第二章江左梅郎", 
        "第一卷江左梅郎第三章损友",
        "第一卷江左梅郎第四章路逢旧交",
        "第一卷江左梅郎第五章途中惊变",
        "第一卷江左梅郎第六章借兵",
        "第一卷江左梅郎第七章殊途",
        "第一卷江左梅郎第八章入京",
        "第一卷江左梅郎第九章长公主",
        "第一卷江左梅郎第十章蒙大统领",
        "第一卷江左梅郎第十一章萧景宁",
        "第一卷江左梅郎第十二章比试",
        "第一卷江左梅郎第十三章霓凰郡主",
        "第一卷江左梅郎第十四章皇子来访",
        "第一卷江左梅郎第十五章庭生",
        "第一卷江左梅郎第十六章靖王",
        "第一卷江左梅郎第十六章择主",
        "第一卷江左梅郎第十六章旧友",
        "第一卷江左梅郎第十六章往事如烟",
        "第一卷江左梅郎第十六章百里奇",
        "第一卷江左梅郎第十六章穆府洗马",
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})